nileiori/GB3/src/boot/GD32F1XX - boot/GD32F1XX - boot2/USER/mmc_sd.c
#include "spi.h"
#include "mmc_sd.h"			   
#include "stm32f10x_spi.h"	
#include "stm32f10x_iwdg.h"	
#include "spi_flash.h"
#include "ff.h"
#include "Rtc.h"
#include "usbh_usr.h"
#include <string.h>
		
void IntToAsc(u32 temp, u8 *buff) ; //将无符号整数转成十进制以8个字符输出
DWORD GetIntTime (u8 Time[6]) ;     //把Hex时间转成长整形
u8 CheckDayTime(u32 iStartTime,u32 iEndTime, u32 fileTime) ; //判断文件创建时间是否符合检索要求
u8 _SearchJPEG(u8 Event, u8 StartTime[6], u8 EndTime[6], u8 *Str,DIR *pdir)  ;  //按时间,事件检索
u8 _SearchWAV(u8 Event, u8 StartTime[6], u8 EndTime[6], u8 *Str,DIR *pdir)  ;  //按时间,事件检索
void SetupIndexFile(void)  ;  //建立索引文件
u8 CheckJPEGEvent(u8 Event, FILINFO *fno) ;  //判断文件事件是否符合检索要求
u8 CheckWAVEvent(u8 Event, FILINFO *fno) ;  //判断文件事件是否符合检索要求
void *MyMemcpy(void *s1,  const void *s2, u32 n, u8 s) ; //s2的数据拷到s1中,n为拷贝长度,s为方向(1:倒序,0:顺序)
u32 SearchFileSD( FIL *fp,u32 SIndex,u32 EIndex, u32 MeidaID) ; //通过媒体ID二分查找法文件序列号

u8 SD_Type=0;//SD卡的类型 
FATFS fs; 

extern u8	SdOnOffFlag;//SD卡在线标志；1在线，0不在线,当sd卡初始化失败时该标志也会清0
//T_FILE_MAG gFileMag;
////////////////////////////////////移植修改区///////////////////////////////////
//移植时候的接口
//data:要写入的数据
//返回值:读到的数据
u8 SD_SPI_ReadWriteByte(u8 data)
{
	return SPIx_ReadWriteByte(data);
}
//SD卡初始化的时候,需要低速
void SD_SPI_SpeedLow(void)
{
 	SPIx_SetSpeed(SPI_BaudRatePrescaler_256);//设置到低速模式	
}
//SD卡正常工作的时候,可以高速了
void SD_SPI_SpeedHigh(void)
{
 	//SPIx_SetSpeed(SPI_BaudRatePrescaler_2);//设置到高速模式	
	//SPIx_SetSpeed(SPI_BaudRatePrescaler_4);
	SPIx_SetSpeed(SPI_BaudRatePrescaler_8);
}
//SPI硬件层初始化
void SD_SPI_Init(void)
{    
	SPIx_Init();
	SD_CS_HIGH();
}
///////////////////////////////////////////////////////////////////////////////////
//取消选择,释放SPI总线
void SD_DisSelect(void)
{
	SD_CS_HIGH();
	SD_SPI_ReadWriteByte(0xff);//提供额外的8个时钟
}
//选择sd卡,并且等待卡准备OK
//返回值:0,成功;1,失败;
u8 SD_Select(void)
{
	SD_CS_LOW();
	if(SD_WaitReady()==0)return 0;//等待成功
	SD_DisSelect();
	return 1;//等待失败
}
//等待卡准备好
//返回值:0,准备好了;其他,错误代码
u8 SD_WaitReady(void)
{
	u32 t=0;
    
    if(0 == SdOnOffFlag)//dxl,2014.6.18sd卡不在线的话直接返回
    {
        return 1;
    }
    
	do
	{
		if(SD_SPI_ReadWriteByte(0XFF)==0XFF)return 0;//OK
		t++;	
        IWDG_ReloadCounter(); //需要喂狗,否则SD卡出现问题后可能会一直重启
	}while(t<0X7FFFF);//不能延时太短时间,至少应该为0x7FFF,此处取值为0X7FFFF
    if(0X7FFFF == t)
    {
        SdOnOffFlag = 0;//指示sd卡总线读写出错了,清除sd卡在线标志,等同于没有接sd卡,dxl,2014.6.18
    }
	return 1;
}
//等待SD卡回应
//Response:要得到的回应值
//返回值:0,成功得到了该回应值
//    其他,得到回应值失败
u8 SD_GetResponse(u8 Response)
{
	u16 Count=0xFFF;
    
    if(0 == SdOnOffFlag)//dxl,2014.6.18
    {
        return MSD_RESPONSE_FAILURE;
    }
	while ((SD_SPI_ReadWriteByte(0XFF)!=Response)&&Count)
    {
        Count--;//等待得到准确的回应  	
        IWDG_ReloadCounter();
    }
	if (Count==0)
    {
        SdOnOffFlag = 0;//指示sd卡总线读写出错了,清除sd卡在线标志,等同于没有接sd卡,dxl,2014.6.18
        return MSD_RESPONSE_FAILURE;
    }//得到回应失败  
	else 
    {   
        return MSD_RESPONSE_NO_ERROR;
    }//正确回应
}
//从sd卡读取一个数据包的内容
//buf:数据缓存区
//len:要读取的数据长度.
//返回值:0,成功;其他,失败;	
u8 SD_RecvData(u8*buf,u16 len)
{			  	  
	if(SD_GetResponse(0xFE))return 1;//等待SD卡发回数据起始令牌0xFE
    while(len--)//开始接收数据
    {
        *buf=SPIx_ReadWriteByte(0xFF);
        buf++;
    }
    //下面是2个伪CRC（dummy CRC）
    SD_SPI_ReadWriteByte(0xFF);
    SD_SPI_ReadWriteByte(0xFF);									  					    
    return 0;//读取成功
}
//向sd卡写入一个数据包的内容 512字节
//buf:数据缓存区
//cmd:指令
//返回值:0,成功;其他,失败;	
u8 SD_SendBlock(u8*buf,u8 cmd)
{	
	u16 t;		  	  
	if(SD_WaitReady())return 1;//等待准备失效
	SD_SPI_ReadWriteByte(cmd);
	if(cmd!=0XFD)//不是结束指令
	{
		for(t=0;t<512;t++)SPIx_ReadWriteByte(buf[t]);//提高速度,减少函数传参时间
	    SD_SPI_ReadWriteByte(0xFF);//忽略crc
	    SD_SPI_ReadWriteByte(0xFF);
		t=SD_SPI_ReadWriteByte(0xFF);//接收响应
		if((t&0x1F)!=0x05)return 2;//响应错误									  					    
	}						 									  					    
    return 0;//写入成功
}

//向SD卡发送一个命令
//输入: u8 cmd   命令 
//      u32 arg  命令参数
//      u8 crc   crc校验值	   
//返回值:SD卡返回的响应															  
u8 SD_SendCmd(u8 cmd, u32 arg, u8 crc)
{
    u8 r1;	
	u8 Retry=0; 
	SD_DisSelect();//取消上次片选
	if(SD_Select())return 0XFF;//片选失效 
	//发送
    SD_SPI_ReadWriteByte(cmd | 0x40);//分别写入命令
    SD_SPI_ReadWriteByte(arg >> 24);
    SD_SPI_ReadWriteByte(arg >> 16);
    SD_SPI_ReadWriteByte(arg >> 8);
    SD_SPI_ReadWriteByte(arg);	  
    SD_SPI_ReadWriteByte(crc); 
	if(cmd==CMD12)SD_SPI_ReadWriteByte(0xff);//Skip a stuff byte when stop reading
    //等待响应，或超时退出
	Retry=0X1F;
	do
	{
		r1=SD_SPI_ReadWriteByte(0xFF);
        IWDG_ReloadCounter();
	}while((r1&0X80) && Retry--);	 
	//返回状态值
    return r1;
}		    																			  
//获取SD卡的CID信息，包括制造商信息
//输入: u8 *cid_data(存放CID的内存，至少16Byte）	  
//返回值:0：NO_ERR
//		 1：错误														   
u8 SD_GetCID(u8 *cid_data)
{
    u8 r1;	   
    //发CMD10命令，读CID
    r1=SD_SendCmd(CMD10,0,0x01);
    if(r1==0x00)
	{
		r1=SD_RecvData(cid_data,16);//接收16个字节的数据	 
    }
	SD_DisSelect();//取消片选
	if(r1)return 1;
	else return 0;
}																				  
//获取SD卡的CSD信息，包括容量和速度信息
//输入:u8 *cid_data(存放CID的内存，至少16Byte）	    
//返回值:0：NO_ERR
//		 1：错误														   
u8 SD_GetCSD(u8 *csd_data)
{
    u8 r1;	 
    r1=SD_SendCmd(CMD9,0,0x01);//发CMD9命令，读CSD
    if(r1==0)
	{
    	r1=SD_RecvData(csd_data, 16);//接收16个字节的数据 
    }
	SD_DisSelect();//取消片选
	if(r1)return 1;
	else return 0;
}  
//获取SD卡的总扇区数（扇区数）   
//返回值:0： 取容量出错 
//       其他:SD卡的容量(扇区数/512字节)
//每扇区的字节数必为512，因为如果不是512，则初始化不能通过.														  
u32 SD_GetSectorCount(void)
{
    u8 csd[16];
    u32 Capacity;  
    u8 n;
	u16 csize;  					    
	//取CSD信息，如果期间出错，返回0
    if(SD_GetCSD(csd)!=0) return 0;	    
    //如果为SDHC卡，按照下面方式计算
    if((csd[0]&0xC0)==0x40)	 //V2.00的卡
    {	
		csize = csd[9] + ((u16)csd[8] << 8) + 1;
		Capacity = (u32)csize << 10;//得到扇区数	 		   
    }else//V1.XX的卡
    {	
		n = (csd[5] & 15) + ((csd[10] & 128) >> 7) + ((csd[9] & 3) << 1) + 2;
		csize = (csd[8] >> 6) + ((u16)csd[7] << 2) + ((u16)(csd[6] & 3) << 10) + 1;
		Capacity= (u32)csize << (n - 9);//得到扇区数   
    }
    return Capacity;
}
u8 SD_Idle_Sta(void)
{
	u16 i;
	u8 retry;	   	  
    for(i=0;i<0xf00;i++);//纯延时，等待SD卡上电完成	 
    //先产生>74个脉冲，让SD卡自己初始化完成
    for(i=0;i<10;i++)SPIx_ReadWriteByte(0xFF); 
    //-----------------SD卡复位到idle开始-----------------
    //循环连续发送CMD0，直到SD卡返回0x01,进入IDLE状态
    //超时则直接退出
    retry = 0;
    do
    {	   
        //发送CMD0，让SD卡进入IDLE状态
        i = SD_SendCmd(CMD0, 0, 0x95);
        retry++;
        IWDG_ReloadCounter();
    }while((i!=0x01)&&(retry<200));
    //跳出循环后，检查原因：初始化成功？or 重试超时？
    if(retry==200)return 1; //失败
	return 0;//成功	 						  
}
//初始化SD卡
u8 SD_Initialize(void)
{
    u8 r1;      // 存放SD卡的返回值
    u16 retry;  // 用来进行超时计数
    u8 buf[4];  
	u16 i;

