nileiori/GB3/src/boot/GD32F1XX - boot/GD32F1XX - boot2/USER/mmc_sd.c
	//LOG_PR_N("SD_Initialize()\r\n");

	SD_SPI_Init();		//初始化IO
 	SD_SPI_SpeedLow();	//设置到低速模式 
    //for(i=0;i<0xf00;i++);//纯延时，等待SD卡上电完成	  
	for(i=0;i<10;i++)SD_SPI_ReadWriteByte(0XFF);//发送最少74个脉冲
	retry=20;
	do
	{
		r1=SD_SendCmd(CMD0,0,0x95);//进入IDLE状态
	}while((r1!=0X01) && retry--);
 	SD_Type=0;//默认无卡
	if(r1==0X01)
	{
		if(SD_SendCmd(CMD8,0x1AA,0x87)==1)//SD V2.0
		{
			for(i=0;i<4;i++)buf[i]=SD_SPI_ReadWriteByte(0XFF);	//Get trailing return value of R7 resp
			if(buf[2]==0X01&&buf[3]==0XAA)//卡是否支持2.7~3.6V
			{
				//retry=0XFFFE;
                retry = 0xfff;
				do
				{
					SD_SendCmd(CMD55,0,0X01);	//发送CMD55
					r1=SD_SendCmd(CMD41,0x40000000,0X01);//发送CMD41
                   IWDG_ReloadCounter();
				}while(r1&&retry--);
				if(retry&&SD_SendCmd(CMD58,0,0X01)==0)//鉴别SD2.0卡版本开始
				{
					for(i=0;i<4;i++)buf[i]=SD_SPI_ReadWriteByte(0XFF);//得到OCR值
					if(buf[0]&0x40)SD_Type=SD_TYPE_V2HC;    //检查CCS
					else SD_Type=SD_TYPE_V2;   
				}
			}
		}else//SD V1.x/ MMC	V3
		{
			SD_SendCmd(CMD55,0,0X01);		//发送CMD55
			r1=SD_SendCmd(CMD41,0,0X01);	//发送CMD41
			if(r1<=1)
			{		
				SD_Type=SD_TYPE_V1;
				//retry=0XFFFE;
                retry = 0xfff;
				do //等待退出IDLE模式
				{
					SD_SendCmd(CMD55,0,0X01);	//发送CMD55
					r1=SD_SendCmd(CMD41,0,0X01);//发送CMD41
                    IWDG_ReloadCounter();
				}while(r1&&retry--);
			}else
			{
				SD_Type=SD_TYPE_MMC;//MMC V3
				//retry=0XFFFE;
                retry = 0xfff;
				do //等待退出IDLE模式
				{											    
					r1=SD_SendCmd(CMD1,0,0X01);//发送CMD1
                    IWDG_ReloadCounter();               
				}while(r1&&retry--);  
			}
			if(retry==0||SD_SendCmd(CMD16,512,0X01)!=0)SD_Type=SD_TYPE_ERR;//错误的卡
		}
	}
	SD_DisSelect();//取消片选
	SD_SPI_SpeedHigh();//高速
	if(SD_Type)return 0;
	else if(r1)return r1; 	   
	return 0xaa;//其他错误
}
 
//读SD卡
//buf:数据缓存区
//sector:扇区
//cnt:扇区数
//返回值:0,ok;其他,失败.
u8 SD_ReadDisk(u8*buf,u32 sector,u8 cnt)
{
	u8 r1;
	if(SD_Type!=SD_TYPE_V2HC)sector <<= 9;//转换为字节地址
	if(cnt==1)
	{
		r1=SD_SendCmd(CMD17,sector,0X01);//读命令
		if(r1==0)//指令发送成功
		{
			r1=SD_RecvData(buf,512);//接收512个字节	   
		}
	}else
	{
		r1=SD_SendCmd(CMD18,sector,0X01);//连续读命令
		do
		{
			r1=SD_RecvData(buf,512);//接收512个字节	 
			buf+=512;  
		}while(--cnt && r1==0); 	
		SD_SendCmd(CMD12,0,0X01);	//发送停止命令
	}   
	SD_DisSelect();//取消片选
	return r1;//
}
//写SD卡
//buf:数据缓存区
//sector:起始扇区
//cnt:扇区数
//返回值:0,ok;其他,失败.
u8 SD_WriteDisk(u8*buf,u32 sector,u8 cnt)
{
	u8 r1;
	if(SD_Type!=SD_TYPE_V2HC)sector *= 512;//转换为字节地址
	if(cnt==1)
	{
		r1=SD_SendCmd(CMD24,sector,0X01);//读命令
		if(r1==0)//指令发送成功
		{
			r1=SD_SendBlock(buf,0xFE);//写512个字节	   
		}
	}else
	{
		if(SD_Type!=SD_TYPE_MMC)
		{
			SD_SendCmd(CMD55,0,0X01);	
			SD_SendCmd(CMD23,cnt,0X01);//发送指令	
		}
 		r1=SD_SendCmd(CMD25,sector,0X01);//连续读命令
		if(r1==0)
		{
			do
			{
				r1=SD_SendBlock(buf,0xFC);//接收512个字节	 
				buf+=512;  
			}while(--cnt && r1==0);
			r1=SD_SendBlock(0,0xFD);//接收512个字节 
		}
	}   
	SD_DisSelect();//取消片选
	return r1;//
}	   

//获得剩余空间(KB)
//返回值:0失败   其他:剩余字节数
DWORD GetRestKByte(void)
{
    DWORD fre_clust;
    FATFS *fs;
    if( f_getfree(ff_NameConver("1:"),&fre_clust,&fs) == FR_OK )
    {
        return fre_clust * fs->csize /2;       
    }
    else
    {
        return 0;
    }
}

/*******************************************************
//功能:将无符号整数转成十进制以8个字符输出
//输入参数：整数,转换后的字符串(正序)
//返回：最大整数99999999, 以8个字符输出 
//例子: 0X1346 -> "00004936"  
*******************************************************/
void IntToAsc(u32 temp, u8 *buff) 
{
	u8 i,j;
	const u32 DivTbl[]={1,1,10,100,1000,10000,100000,1000000,10000000};
	for(i=8,j=0; i>0; i--)
	{
		buff[j++]=temp/DivTbl[i]+'0';
		temp=temp%DivTbl[i];
	}
    if(j>=8)
        buff[j]='\0';
}
/*******************************************************
Description:建立索引文件
Input: 
Output:
Return: 
note:    
*******************************************************/
void SetupIndexFile(void) 
{
	//LOG_PR_N("SetupIndexFile()\r\n");
	
/*
    FIL file;
    u8 buffer[9]={1,0,0,0,1,0,0,0,2};
    u32 Bw;     
    //WAV目录下创建文件,保存最早的文件名  FA_CREATE_NEW
    {   
        if(f_open(&file,"1:/WAV/INDEX.TXT",FA_CREATE_NEW|FA_READ|FA_WRITE) != FR_EXIST)
        { //文件不存在,创建文件
            f_close(&file);
            if(f_open(&file,"1:/WAV/INDEX.TXT",FA_CREATE_ALWAYS|FA_READ|FA_WRITE) == FR_OK)  
            {                       
               f_write(&file,buffer,sizeof(buffer),&Bw);                          
            } 
            f_close(&file);

            if(f_open(&file,"1:/WAV/INDEXBAK.TXT",FA_CREATE_ALWAYS|FA_READ|FA_WRITE) == FR_OK)  
            {                       
               f_write(&file,buffer,sizeof(buffer),&Bw);                          
            }                                
        }
        f_close(&file);  
    }
    {   
        if(f_open(&file,"1:/JPEG/INDEX.TXT",FA_CREATE_NEW|FA_READ|FA_WRITE) != FR_EXIST)
        { //文件不存在,创建文件
            f_close(&file);
            if(f_open(&file,"1:/JPEG/INDEX.TXT",FA_CREATE_ALWAYS|FA_READ|FA_WRITE) == FR_OK)  
            {                       
               f_write(&file,buffer,sizeof(buffer),&Bw);                          
            } 
            f_close(&file);

            if(f_open(&file,"1:/JPEG/INDEXBAK.TXT",FA_CREATE_ALWAYS|FA_READ|FA_WRITE) == FR_OK)  
            {                       
               f_write(&file,buffer,sizeof(buffer),&Bw);                          
            }                      
        }
        f_close(&file);
    }
*/
	
}
/*******************************************************
Description:SD文件初始化
Input: 
Output:
Return: 
note:    
*******************************************************/  
void InitSDFile(void) 
{
    FRESULT Result;
    //DIR dir;
    //FILINFO fileInfo;

	//LOG_PR_N("InitSDFile()\r\n");
    //创建目录1:WAV
    Result = f_mkdir(ff_NameConver("1:/WAV"));
    if(Result != FR_OK)
    {
        //SdOnOffFlag = 0;//dxl,2014.6.18,认为SD卡坏了
        if(Result == FR_EXIST)
        { //存在该目录,删除里面的文件  
            ;
#if 0            
            if(f_opendir(&dir, "1:/WAV") == FR_OK)   //打开目录成功
            {
                while(1)
                {
                    u8 Buffer[25]="1:/WAV/";
                    
                    IWDG_ReloadCounter();             
                    Result = f_readdir(&dir,&fileInfo);
                    if(Result != FR_OK || fileInfo.fname[0]==0)break;
                    if(fileInfo.fname[0]=='.')continue  ;
                    strcat((char *)Buffer,fileInfo.fname);
                    Result = f_unlink((char const *)Buffer);       //删除文件
                    if(Result != FR_OK) break;                   
                }
            } 
#endif
        }
        else
        {
            SdOnOffFlag = 0;//dxl,2014.8.25,认为SD卡坏了,原2014.6.18的修改有bug
        }
    }


    //创建目录1:JPEG
    Result = f_mkdir(ff_NameConver("1:/JPEG"));
    if(Result != FR_OK)
    {
        //SdOnOffFlag = 0;//dxl,2014.6.18,认为SD卡坏了
        if(Result == FR_EXIST)
        { //存在该目录,删除里面的文件  
            ;
#if 0  
            if(f_opendir(&dir, "1:/JPEG") == FR_OK)   //打开目录成功
            {
                while(1)
                {
                    u8 Buffer[25]="1:/JPEG/";
                    
                  IWDG_ReloadCounter();         
                    Result = f_readdir(&dir,&fileInfo);
                    if(Result != FR_OK || fileInfo.fname[0]==0)break;
                    if(fileInfo.fname[0]=='.')continue  ;
                    strcat((char *)Buffer,fileInfo.fname);
                    Result = f_unlink((char const *)Buffer);       //删除文件
                    if(Result != FR_OK) break;                  
                }
            } 
#endif            
        }
        else
        {
            SdOnOffFlag = 0;//dxl,2014.8.25,原2014.6.18的修改有bug
        }
    } 
    SetupIndexFile();
}

/*******************************************************
Description:获得图像文件名,Str空间不能小于25
Input: 
Output: 文件名
Return: 1:成功  0:失败
note:    
*******************************************************/ 
#define MAX_REST_SPACE   (100000) //KBYTES
#define MIN_REST_SPACE   (1000)   //KBYTES

//#define MAX_REST_SPACE   (3860580-1000) //DEBUG
//#define MIN_REST_SPACE   (3860580-2100)   //DEBUG
/*
u8 FetchJPEGFileName(u8 *Str) 
{
    FIL file,fileBak;  
    u8 Buffer[15],i;   
    u8 FileName[25];
    u32 Br,Bw;  
    u32 Result;   
    u32 StartIndex; //起始索引号  从1开始
    u32 EndIndex;   //结束索引号  从1开始
    
    u32 CStartIndex; //起始索引号 从0开始
    u32 CEndIndex;   //结束索引号 从0开始  
    //参数检测
    if(Str == NULL)
        return 0;
        
    //获得头尾文件序列号
    if(f_open(&file,"1:/JPEG/INDEX.TXT",FA_OPEN_ALWAYS|FA_READ|FA_WRITE) != FR_OK)  
        return 0;           
    f_read(&file,Buffer,9,&Br);   
    
    f_open(&fileBak,"1:/JPEG/INDEXBAK.TXT",FA_OPEN_ALWAYS|FA_READ|FA_WRITE);       
    Buffer[9] = 0; //借用Buffer[9],做校验和处理
    for(i=0; i<8; i++)
    {
        Buffer[9] += Buffer[i];
    }
    if(Buffer[9] != Buffer[8])
    { //校验出错
        f_read(&fileBak,Buffer,9,&Br);           
    }  
    
    StartIndex = *(u32 *)&Buffer[0]; 
    EndIndex =  *(u32 *)&Buffer[4];     
    CStartIndex = StartIndex - 1;
    CEndIndex = EndIndex - 1;
    Result = EndIndex;            //获得返回文件索引ID      
    
    
    if( (CEndIndex+1)%MAX_FILES_SUM == CStartIndex || GetRestKByte() < MIN_REST_SPACE) 
    { //索引满了或空间不够           
        do
        {   
            if(CEndIndex == CStartIndex)
            {//空了
                f_close(&file);
                f_close(&fileBak);  
                return 0;    
            }
            //空间过小,需要删除文件                          
            IntToAsc(CStartIndex+1,Buffer);
            strcpy((char *)FileName,"1:/JPEG/");
            strcat((char *)FileName,(char const *)Buffer);   
            strcat((char *)FileName,".JPG");       
            f_unlink((char const *)FileName);                       //删除文件腾出空间                
            CStartIndex = (CStartIndex+1)%MAX_FILES_SUM;
            //IWDG_ReloadCounter();dxl,2013.11.21,去掉喂狗,SD卡驱动有问题,会导致程序一直死在SD的某个驱动里面
        }
        while(GetRestKByte() < MAX_REST_SPACE );
    }
    CEndIndex = (CEndIndex+1)%MAX_FILES_SUM;
    
    StartIndex = CStartIndex + 1;
    EndIndex = CEndIndex + 1;
    {
        u8 i;
        for(i=0; i<4; i++)
            Buffer[i] =  *((u8 *)&StartIndex +i);
        for(i=0; i<4; i++)
            Buffer[i+4] =  *((u8 *)&EndIndex +i);   
            
        Buffer[8] = 0; 
        for(i=0; i<8; i++)
        {
            Buffer[8] += Buffer[i]; 
        }
                    
        f_lseek(&file,0);      
        f_lseek(&fileBak,0);     
        f_write(&file,Buffer,9,&Bw);
        f_write(&fileBak,Buffer,9,&Bw); 
    }
    f_close(&file);
    f_close(&fileBak); 
    IntToAsc(Result,Buffer);

    strcpy((char *)FileName,"1:/JPEG/");
    strcat((char *)FileName,(char const *)Buffer);   
    strcat((char *)FileName,".JPG");                         
    strcpy((char *)Str,(char const *)FileName);
    return 1;
}
*/
/*********************************************************************
//函数名称	:FetchJPEGFileName
//功能		:获取文件名
//输入		:
//输出		:
//使用资源	:
//全局变量	:   
//调用函数	:
//中断资源	:  
//返回		:
//备注		:
*********************************************************************/
u8  FetchJPEGFileName(u8 *pBuffer)
{
	TIME_T  tt;
	
	u8 *p = NULL;
	u8 length;

