nileiori/GB3/src/boot/GD32F1XX - boot/GD32F1XX - boot2/USER/mmc_sd.c
	//LOG_PR_N("FetchJPEGFileName()\r\n");
	RTC_ReadTime(&tt);
	p = pBuffer;
	length = 0;
	
	//根目录路径
	*p++ = '1';
	length++;
	*p++ = ':';
	length++;
	*p++ = '/';
	length++;
	*p++ = 'J';
	length++;
	*p++ = 'P';
	length++;
	*p++ = 'E';
	length++;
	*p++ = 'G';
	length++;
	*p++ = '/';
	length++;
	
	//文件名
	*p++ = tt.year/10+0x30;
	length++;
	*p++ = tt.year%10+0x30;
	length++;
	*p++ = tt.month/10+0x30;
	length++;
	*p++ = tt.month%10+0x30;
	length++;
	*p++ = tt.day/10+0x30;
	length++;
	*p++ = tt.day%10+0x30;
	length++;
	*p++ = tt.hour/10+0x30;
	length++;
	*p++ = tt.hour%10+0x30;
	length++;
	*p++ = tt.min/10+0x30;
	length++;
	*p++ = tt.min%10+0x30;
	length++;
	*p++ = tt.sec/10+0x30;
	length++;
	*p++ = tt.sec%10+0x30;
	length++;
	//后缀
	*p++ = '.';
	length++;
	*p++ = 'j';
	length++;
	*p++ = 'p';
	length++;
	*p++ = 'e';
	length++;
	*p++ = 'g';
	length++;
	//结尾字符
	*p++ = 0;
	length++;
		
	return length;
}
/*******************************************************
Description:获得录音文件名,Str空间不能小于25
Input: 
Output: 文件名
Return: 1:成功  0:失败
note:    
*******************************************************/ 
/*
u8 FetchWAVFileName(u8 *Str) 
{
    FIL file,fileBak;  
    u8 Buffer[15],i;  
    u8 FileName[25];
    u32 Br,Bw;  
    u32 Result;   
    u32 StartIndex; //起始索引号  从1开始
    u32 EndIndex;   //结束索引号  从1开始
    
    u32 CStartIndex; //起始索引号 从0开始
    u32 CEndIndex;   //结束索引号 从0开始  
    //参数检测
    if(Str == NULL)
        return 0;
      
    //获得头尾文件序列号
    if(f_open(&file,"1:/WAV/INDEX.TXT",FA_OPEN_ALWAYS|FA_READ|FA_WRITE) != FR_OK)  
        return 0;           
    f_read(&file,Buffer,9,&Br);   
    
    f_open(&fileBak,"1:/WAV/INDEXBAK.TXT",FA_OPEN_ALWAYS|FA_READ|FA_WRITE);      
    Buffer[9] = 0; //借用Buffer[9],做校验和处理
    for(i=0; i<8; i++)
    {
        Buffer[9] += Buffer[i];
    }
    if(Buffer[9] != Buffer[8])
    { //校验出错
        f_read(&fileBak,Buffer,9,&Br);           
    }  
    
    StartIndex = *(u32 *)&Buffer[0]; 
    EndIndex =  *(u32 *)&Buffer[4];     
    CStartIndex = StartIndex - 1;
    CEndIndex = EndIndex - 1;
    Result = EndIndex;            //获得返回文件索引ID      
    
    
    if( (CEndIndex+1)%MAX_FILES_SUM == CStartIndex || GetRestKByte() < MIN_REST_SPACE) 
    { //索引满了或空间不够           
        do
        {   
            if(CEndIndex == CStartIndex)
            {//空了
                f_close(&file);
                f_close(&fileBak);  
                return 0;    
            }
            //空间过小,需要删除文件                          
            IntToAsc(CStartIndex+1,Buffer);
            strcpy((char *)FileName,"1:/WAV/");
            strcat((char *)FileName,(char const *)Buffer);   
            strcat((char *)FileName,".WAV");       
            f_unlink((char const *)FileName);                       //删除文件腾出空间                
            CStartIndex = (CStartIndex+1)%MAX_FILES_SUM;
            IWDG_ReloadCounter(); dxl,2013.11.21,去掉喂狗,SD卡驱动有问题,会导致程序一直死在SD的某个驱动里面
        }
        while(GetRestKByte() < MAX_REST_SPACE );
    }
    CEndIndex = (CEndIndex+1)%MAX_FILES_SUM;
    
    StartIndex = CStartIndex + 1;
    EndIndex = CEndIndex + 1;
    {
        u8 i;
        for(i=0; i<4; i++)
            Buffer[i] =  *((u8 *)&StartIndex +i);
        for(i=0; i<4; i++)
            Buffer[i+4] =  *((u8 *)&EndIndex +i);   
            
        Buffer[8] = 0;  
        for(i=0; i<8; i++)
        {
            Buffer[8] += Buffer[i]; 
        }
                    
        f_lseek(&file,0);      
        f_lseek(&fileBak,0);      
        f_write(&file,Buffer,9,&Bw);
        f_write(&fileBak,Buffer,9,&Bw); 
    }
    f_close(&file);
    f_close(&fileBak);  
    IntToAsc(Result,Buffer);

    strcpy((char *)FileName,"1:/WAV/");
    strcat((char *)FileName,(char const *)Buffer);   
    strcat((char *)FileName,".WAV");                         
    strcpy((char *)Str,(char const *)FileName);
    return 1;
}
*/
u8  FetchWAVFileName(u8 *pBuffer)
{
	
	TIME_T  tt;
	u8 *p;
	u8 length;

	//LOG_PR_N("FetchWAVFileName()\r\n");
	RTC_ReadTime(&tt);
	p = pBuffer;
	length = 0;
	
	//根目录路径
	*p++ = '1';
	length++;
	*p++ = ':';
	length++;
	*p++ = '/';
	length++;
	*p++ = 'W';
	length++;
	*p++ = 'A';
	length++;
	*p++ = 'V';
	length++;
	*p++ = '/';
	length++;
	
	//文件名
	*p++ = tt.year/10+0x30;
	length++;
	*p++ = tt.year%10+0x30;
	length++;
	*p++ = tt.month/10+0x30;
	length++;
	*p++ = tt.month%10+0x30;
	length++;
	*p++ = tt.day/10+0x30;
	length++;
	*p++ = tt.day%10+0x30;
	length++;
	*p++ = tt.hour/10+0x30;
	length++;
	*p++ = tt.hour%10+0x30;
	length++;
	*p++ = tt.min/10+0x30;
	length++;
	*p++ = tt.min%10+0x30;
	length++;
	*p++ = tt.sec/10+0x30;
	length++;
	*p++ = tt.sec%10+0x30;
	length++;
	//后缀
	*p++ = '.';
	length++;
	*p++ = 'w';
	length++;
	*p++ = 'a';
	length++;
	*p++ = 'v';
	length++;
	//结尾字符
	*p++ = 0;
	length++;
		
	return length;
}
/*******************************************************
Description:把Hex时间转成长整形
Input: Hex,Year-Month-Day-Hour-Minte-Second
Output:
Return: 长整形时间值
notye:    
*******************************************************/ 
DWORD GetIntTime (u8 Time[6])
{
    u8 Temp;
    DWORD iDayTime; 
    
    iDayTime = Time[0] + 2000 - 1980; //Year
    iDayTime = iDayTime<<25 ;
    Temp = Time[1];                   //Month
    iDayTime |= (Temp<<21);
    Temp = Time[2];                   //Day
    iDayTime |= (Temp<<16);
    Temp = Time[3];                   //Hour
    iDayTime |= (Temp<<11);
    Temp = Time[4];                   //Min
    iDayTime |= (Temp<<5);
    Temp = Time[5];                   //Sec
    iDayTime |= (Temp>>1);
	return iDayTime;
}

/*******************************************************
Description:判断文件创建时间是否符合检索要求
Input: 开始时间,结束时间,文件创建时间
Output:
Return: 1:符合检索要求 0:不符合
note:    
*******************************************************/ 
u8 CheckDayTime(u32 iStartTime,u32 iEndTime, u32 fileTime) 
{
    if(iStartTime < fileTime && iEndTime > fileTime)
    {
        return 1;    
    }
    else
    {
        return 0;
    }
}

/*******************************************************
Description:判断文件事件是否符合检索要求
Input: 事件,文件信息
Output:
Return: 1:符合检索要求 0:不符合
note:    
*******************************************************/ 
u8 CheckJPEGEvent(u8 Event, FILINFO *fno) 
{
    FIL file;
    u8 Buffer[40]={0};
    u32 Br;
    u8  FileName_1[_MAX_LFN];
    
