nileiori/GB3/src/boot/GD32F1XX - boot/GD32F1XX - boot2/USER/mmc_sd.c
    strcpy((char *)Buffer,"1:/JPEG/");
    ff_NameForward(FileName_1,fno->fname);
    strcat((char *)Buffer,(const char *)FileName_1);
    if(f_open(&file,ff_NameConver(Buffer),FA_OPEN_EXISTING|FA_READ) == FR_OK) //只读
    {                                          
        f_lseek(&file,file.fsize-sizeof(T_MEDIA_RECORD));
        f_read(&file,Buffer,sizeof(T_MEDIA_RECORD),&Br);
        if(Buffer[7] == Event)
        {
            f_close(&file);
            return 1;    
        }              
    }  
    f_close(&file);      
    return 0;
}
/*******************************************************
Description:判断文件事件是否符合检索要求
Input: 事件,文件信息
Output:
Return: 1:符合检索要求 0:不符合
note:    
*******************************************************/ 
u8 CheckWAVEvent(u8 Event, FILINFO *fno) 
{
    FIL file;
    u8 Buffer[40]={0};
    u32 Br;
    u8  FileName_1[_MAX_LFN];
    strcpy((char *)Buffer,"1:/WAV/");
    ff_NameForward(FileName_1,fno->fname);
    strcat((char *)Buffer,(const char *)FileName_1);
    if(f_open(&file,ff_NameConver(Buffer),FA_OPEN_EXISTING|FA_READ) == FR_OK)           //只读
    {                                          
        f_lseek(&file,file.fsize-sizeof(T_MEDIA_RECORD));
        f_read(&file,Buffer,sizeof(T_MEDIA_RECORD),&Br);
        if(Buffer[7] == Event)
        {
            f_close(&file);
            return 1;    
        }              
    }  
    f_close(&file);      
    return 0;
}

/*******************************************************
Description:由文件序列号获得绝对文件名
Input: 文件序列号码如:"0000000N",
Output: FullFileName
Return: NULL
note: filename不能小于9字节
      FullFileName不能小于25字节
*******************************************************/ 
void GetFullJPEGFileName(u8* filename)
{
    u8 Buff[25];
    if(strstr((char const *)filename, "1:") == NULL) 
    {//不包含字符串"1:"
        strcpy((char *)Buff,"1:/JPEG/");
        strcat((char *)Buff,(char const *)filename);
        if(strstr((char const *)filename, ".JPG") == NULL)
        { //没有找到".JPG"
            strcat((char *)Buff,".JPG");
            strcpy((char *)filename,(char const *)Buff);
        }
    }       
}
/*******************************************************
Description:由文件序列号获得绝对文件名
Input: 文件序列号码如:"0000000N",
Output: FullFileName
Return: NULL
note: filename不能小于25字节     
*******************************************************/ 
void GetFullWAVFileName(u8* filename) 
{
    u8 Buff[25];
    if(strstr((char const *)filename, "1:") == NULL) 
    {//不包含字符串"1:"
        strcpy((char *)Buff,"1:/WAV/");
        strcat((char *)Buff,(char const *)filename);
        if(strstr((char const *)filename, ".WAV") == NULL)
        { //没有找到".WAV"
            strcat((char *)Buff,".WAV");
            strcpy((char *)filename,(char const *)Buff);
        }
    }       
}
/*******************************************************
Description:获取文件记录
Input: 完整文件名称,必须包含路径,文件记录空间
Output:
Return: 1:成功 0:失败
note: 
*******************************************************/    
u8 GetFileRecord(u8 *filename, T_MEDIA_RECORD *Rec)
{
    FIL file;
    FRESULT Result;
    u32 Br;
    u8 Buf[4];
    if(filename == NULL || Rec == NULL)
        return 0;
        
    if(f_open(&file,ff_NameConver(filename),FA_OPEN_EXISTING|FA_READ) == FR_OK)           //只读
    {                                          
        Result = f_lseek( &file, file.fsize-sizeof(T_MEDIA_RECORD) );
        if(Result == FR_OK)
        {
            Result = f_read( &file,(u8 *)Rec,sizeof(T_MEDIA_RECORD),&Br );
            if(Result == FR_OK)
            {
                MyMemcpy(Buf, (u8 *)Rec, 4 , 1);  //T_MEDIA_RECORD的MediaID字段是大端存储,需要调整
                Rec->MediaID = *(u32 *)Buf;
                f_close(&file);
                return 1;                
            }        
        }            
    }  
    f_close(&file);      
    return 0;    
}

//-----------------------------------------------
//功能:s2的数据拷到s1中,n为拷贝长度,s为方向(1:倒序,0:顺序)
//输入:
//输出:
//备注:
//-----------------------------------------------
void *MyMemcpy(void *s1,  const void *s2, u32 n, u8 s)
{       /* copy char s2[n] to s1[n] in any order */
    char *su1 = (char *)s1;
    const char *su2 = (const char *)s2;
    u32 i;
    if(s==0)
    {
        for (; 0 < n; ++su1, ++su2, --n)
          *su1 = *su2;
    }
    else
    {
        for(i=0 ;i<n; i++)
        {
            *(su1+n-1-i) = *(su2+i);
        }	
    }
    return (s1);
}

/*******************************************************
//功能:按时间,事件检索
//输入参数：Event:事件类型, StartTime[6],EndTime[6]:YY-
//MM-DD-hh-mm-ss(Hex),Str返回的文件序列号,不能小于9字节
//返回：文件序列号长度,0表示检索完成
//注意
如果Event=0XFF, 表示仅仅按时间检索
如果 StartTime[0],EndTime[0] 有一个为0,表示仅仅按事件检索,
符合要求的文件ID通过Str输出,如: “0000000N”,每调用一次输
出一个文件序列,直到返回0
*******************************************************/
u8 _SearchJPEG(u8 Event, u8 StartTime[6], u8 EndTime[6], u8 *Str,DIR *pdir)  
{
    /*
    FILINFO fileInfo;
    u32 iStartTime,iEndTime,fileTime;
    FRESULT Result;
    static u8 SearchCnt=0;
    u8  FileName_1[_MAX_LFN];
    
    //参数检测
    if(Str == NULL)
        return 0;    
    
    while(1) 
    {
        IWDG_ReloadCounter();
        Result = f_readdir(pdir,&fileInfo);    //读目录信息到文件状态结构中
        if(Result != FR_OK || fileInfo.fname[0]==0)break;
        ff_NameForward(FileName_1,fileInfo.fname);
        if(FileName_1[0]=='.')continue  ;
        if(strstr((const char *)FileName_1, "INDEX") != NULL) continue;	//包含INDEX字符串的文件跳过
        SetOnceTimer(SEARCH_FILE_TIMER,50*2);  //2s  
        iStartTime = GetIntTime(StartTime);
        iEndTime   = GetIntTime(EndTime);
        fileTime = (fileInfo.fdate <<16) | fileInfo.ftime; //得到文件创建时间
        if(Event == 0XFF)
        {
            if(StartTime[0] && EndTime[0])
            { //按时间检索                
                if(CheckDayTime(iStartTime,iEndTime, fileTime))
                {
                    ff_NameForward(FileName_1,fileInfo.fname);
                    strncpy((char *)Str,(const char *)FileName_1,8);    
                    Str[8] = '\0';
                    if(++SearchCnt < 11)   
                    {
                        return strlen((char const*)Str);
                    }
                    else
                    {
                        SearchCnt=0;
                        break;
                    }
                }
                continue;//继续检索
            }    
            else
            {
                break;           //检索条件错误    
            }           
        }
        else
        {
            if(StartTime[0] && EndTime[0])
            { //按时间\事件检索
                if( !CheckDayTime(iStartTime,iEndTime, fileTime) )
                {
                    continue;//继续检索
                }
                else
                {
                    if(CheckJPEGEvent(Event, &fileInfo))
                    {
                        ff_NameForward(FileName_1,fileInfo.fname);
                        strncpy((char *)Str,(const char *)FileName_1,8);    
                        Str[8] = '\0';
                        if(++SearchCnt < 11)   
                        {
                            return strlen((char const*)Str);
                        }
                        else
                        {
                            SearchCnt=0;
                            break;
                        }                                                  
                    }   
                    continue;//继续检索
                }
                
