nileiori/GB3/src/boot/GD32F1XX - boot/GD32F1XX - boot2/USER/mmc_sd.c
            }    
            else
            { //按事件检索
                if(CheckJPEGEvent(Event, &fileInfo))
                {
                     ff_NameForward(FileName_1,fileInfo.fname);
                    strncpy((char *)Str,(const char *)FileName_1,8);    
                    Str[8] = '\0';
                    if(++SearchCnt < 11)   
                    {
                        return strlen((char const*)Str);
                    }
                    else
                    {
                        SearchCnt=0;
                        break;
                    }                                            
                }   
                continue;//继续检索                               
            } 
            
        }
    }
		*/
    return 0;
}            
/*******************************************************
//功能:按时间,事件检索
//输入参数：Event:事件类型, StartTime[6],EndTime[6]:YY-
//MM-DD-hh-mm-ss(Hex),Str返回的文件序列号,不能小于9字节
//返回：文件序列号长度,0表示检索完成
//注意
如果Event=0XFF, 表示仅仅按时间检索
如果 StartTime[0],EndTime[0] 有一个为0,表示仅仅按事件检索,
符合要求的文件ID通过Str输出,如: “0000000N”,每调用一次输
出一个文件序列,直到返回0
*******************************************************/
u8 _SearchWAV(u8 Event, u8 StartTime[6], u8 EndTime[6], u8 *Str,DIR *pdir)  
{
    /*
    FILINFO fileInfo;
    u32 iStartTime,iEndTime,fileTime;
    FRESULT Result;
    static u8 SearchCnt=0;
    u8 FileName_1[_MAX_LFN];
    
    //参数检测
    if(Str == NULL)
        return 0;    
    
    while(1) 
    {
       IWDG_ReloadCounter();
        Result = f_readdir(pdir,&fileInfo);    //读目录信息到文件状态结构中
        if(Result != FR_OK || fileInfo.fname[0]==0)break;
        ff_NameForward(FileName_1,fileInfo.fname);
        if(FileName_1[0]=='.')continue  ;
        if(strstr((const char *)FileName_1,"INDEX") != NULL) continue;	//包含INDEX字符串的文件跳过
//        SetOnceTimer(SEARCH_FILE_TIMER,50*2);  //2s  
        iStartTime = GetIntTime(StartTime);
        iEndTime   = GetIntTime(EndTime);
        fileTime = (fileInfo.fdate <<16) | fileInfo.ftime; //得到文件创建时间
        if(Event == 0XFF)
        {
            if(StartTime[0] && EndTime[0])
            { //按时间检索                
                if(CheckDayTime(iStartTime,iEndTime, fileTime))
                {
                    ff_NameForward(FileName_1,fileInfo.fname);
                    strncpy((char *)Str,(const char *)FileName_1,8);    
                    Str[8] = '\0';
                    if(++SearchCnt < 11)   
                    {
                        return strlen((char const*)Str);
                    }
                    else
                    {
                        SearchCnt=0;
                        break;
                    }
                }
                continue;//继续检索
            }    
            else
            {
                break;           //检索条件错误    
            }           
        }
        else
        {
            if(StartTime[0] && EndTime[0])
            { //按时间\事件检索
                if( !CheckDayTime(iStartTime,iEndTime, fileTime) )
                {
                    continue;//继续检索
                }
                else
                {
                    if(CheckWAVEvent(Event, &fileInfo))
                    {
                         ff_NameForward(FileName_1,fileInfo.fname);
                        strncpy((char *)Str,(const char *)FileName_1,8);    
                        Str[8] = '\0';
                        if(++SearchCnt < 11)   
                        {
                            return strlen((char const*)Str);
                        }
                        else
                        {
                            SearchCnt=0;
                            break;
                        }                                                
                    }   
                    continue;//继续检索
                }
                
            }    
            else
            { //按事件检索
                if(CheckWAVEvent(Event, &fileInfo))
                {
                    ff_NameForward(FileName_1,fileInfo.fname);
                    strncpy((char *)Str,(const char *)FileName_1,8);    
                    Str[8] = '\0';                    
                    if(++SearchCnt < 11)   
                    {
                        return strlen((char const*)Str);
                    }
                    else
                    {
                        SearchCnt=0;
                        break;
                    }                  
                }   
                continue;//继续检索                               
            } 
            
        }
    }
		*/
    return 0;
} 
/*******************************************************
//功能:按时间,事件检索
//输入参数：Event:事件类型, StartTime[6],EndTime[6]:YY-
//MM-DD-hh-mm-ss(Hex),Str返回的文件序列号,不能小于9字节
//返回：文件序列号长度,0表示检索完成
//注意
如果Event=0XFF, 表示仅仅按时间检索
如果 StartTime[0],EndTime[0] 有一个为0,表示仅仅按事件检索,
符合要求的文件ID通过Str输出,如: “0000000N”,每调用一次输
出一个文件序列,直到返回0
*******************************************************/
u8 SearchJPEG(u8 Event, u8 StartTime[6], u8 EndTime[6], u8 *Str) 
{
	/*
    static u8 Status=0;
    static DIR dir;    
    u8 Result;
    
    
    //参数检测
    if(Str == NULL)
        return 0;
        
    if( IsOverTime(SEARCH_FILE_TIMER) )
        Status = 0;                           //检索文件超时,重新检索
        
    if(Status == 0)
    {
        if(f_opendir(&dir, ff_NameConver("1:/JPEG")) != FR_OK)   
            return 0;                        //打开目录失败
        Status = 1;  
        Result =  _SearchJPEG(Event,StartTime,EndTime,Str,&dir);
        if( !Result )
        {
            Status = 0;       
        }
    }     
    else
    {
        Result =  _SearchJPEG(Event,StartTime,EndTime,Str,&dir);
        if( !Result )
        {
            Status = 0;       
        }       
    } 
		*/
    return 0; 
}
/*******************************************************
//功能:按时间,事件检索
//输入参数：Event:事件类型, StartTime[6],EndTime[6]:YY-
//MM-DD-hh-mm-ss(Hex),Str返回的文件序列号,不能小于9字节
//返回：文件序列号长度,0表示检索完成
//注意
如果Event=0XFF, 表示仅仅按时间检索
如果 StartTime[0],EndTime[0] 有一个为0,表示仅仅按事件检索,
符合要求的文件ID通过Str输出,如: “0000000N”,每调用一次输
出一个文件序列,直到返回0
*******************************************************/
u8 SearchWAV(u8 Event, u8 StartTime[6], u8 EndTime[6], u8 *Str) 
{
	/*
    static u8 Status=0;
    static DIR dir;
    u8 Result;
    
    
    //参数检测
    if(Str == NULL)
        return 0;
        
