nileiori/GB3/src/boot/GD32F1XX - boot/GD32F1XX - boot2/USER/mmc_sd.c
    if( IsOverTime(SEARCH_FILE_TIMER) )
        Status = 0;                           //检索文件超时,重新检索
        
    if(Status == 0)
    {
        if(f_opendir(&dir, ff_NameConver("1:/WAV")) != FR_OK)   
            return 0;                        //打开目录失败
        Status = 1;  
        Result =  _SearchWAV(Event,StartTime,EndTime,Str,&dir);
        if( !Result )
        {
            Status = 0;       
        }
    }     
    else
    {
        Result =  _SearchWAV(Event,StartTime,EndTime,Str,&dir);
        if( !Result )
        {
            Status = 0;       
        }       
    } 
    return Result; 
		*/
		return 0;
}

/*******************************************************
//描述:在保存完JPEG文件后,需要调用该函数,目的是建立MediaID
//与文件序列号的对应关系,方便通过MediaID查找文件.
//功能:保存JPEG ID号
//输入参数：JPEG ID
//输出参数: NULL
//返回:1:成功  0:失败
*******************************************************/
u8 SaveJPEGMediaID(u32 MediaID)
{
/*
	//LOG_PR_N("SaveJPEGMediaID()\r\n");   
    u8 err=0; 
    FIL file;
    u32 Brw;
    u8 Buffer[15];
    u32 Index;      //最后一个文件的索引号 
  
    do
    {    
        if(f_open(&file,"1:/JPEG/INDEX.TXT",FA_OPEN_ALWAYS|FA_READ|FA_WRITE) == FR_OK)  
        {                                          
            f_read(&file,Buffer,8,&Brw);
            //StartIndex = *(u32 *)&Buffer[0]; 
            Index =  *(u32 *)&Buffer[4] - 1;   
            if(Index == 0)
                Index = MAX_FILES_SUM;
            
        }
        else
        {
            err = 1;
            break;
        } 
        if( f_lseek(&file,512+(Index-1)*sizeof(u32)) != FR_OK)  //跳过头尾索引号,Index从1开始
        {
            err = 1; 
            break;
        }
        if(f_write(&file,(u8 *)&MediaID,sizeof(u32),&Brw) != FR_OK)    //在对应索引号写入MediaID
        {
            err = 1;
            break;
        }
    }
    while(0);
    f_close(&file);
    if(err)
        return 0;
    else
        return 1; 
*/
   return 1;
	
}
/*******************************************************
//描述:在保存完WAV文件后,需要调用该函数,目的是建立MediaID
//与文件序列号的对应关系,方便通过MediaID查找文件.
//功能:保存WAV ID号
//输入参数：WAV ID
//输出参数: NULL
//返回:1:成功  0:失败
*******************************************************/
u8 SaveWAVMediaID(u32 MediaID) 
{
	//LOG_PR_N("SaveWAVMediaID()\r\n"); 
/*
    u8 err=0; 
    FIL file;
    u32 Brw;
    u8 Buffer[15];
    u32 Index;      //最后一个文件的索引号    
  
    do
    {    
        if(f_open(&file,"1:/WAV/INDEX.TXT",FA_OPEN_ALWAYS|FA_READ|FA_WRITE) == FR_OK)  
        {                                          
            f_read(&file,Buffer,8,&Brw);
            //StartIndex = *(u32 *)&Buffer[0]; 
            Index =  *(u32 *)&Buffer[4] - 1;                                       
            if(Index == 0)
                Index = MAX_FILES_SUM;
        }
        else
        {
            err = 1;
            break;
        } 
        if( f_lseek(&file,512+(Index-1)*sizeof(u32)) != FR_OK)  //跳过头尾索引号,Index从1开始
        {
            err = 1; 
            break;
        }
        if(f_write(&file,(u8 *)&MediaID,sizeof(u32),&Brw) != FR_OK)    //在对应索引号写入MediaID
        {
            err = 1;
            break;
        }
    }
    while(0);
    f_close(&file);
    if(err)
        return 0;
    else
        return 1; 
*/
    return 1;
}
/*******************************************************
//功能:通过媒体ID二分查找法文件序列号
//输入参数：文件指针,起始索引,结束索引,带查找的媒体ID
//输出参数:NULL
//返回:0:未找到 其他:文件序列号
*******************************************************/
u32 SearchFileSD( FIL *fp,u32 SIndex,u32 EIndex, u32 MeidaID) 
{
    u32 lo = SIndex;
    u32 hi = EIndex;
    u32 mid;   //折半值
    u32 ID;    //检索到的ID
    u32 Temp;
    u32 Brw;
    
    while(lo < hi)
    {
        mid =(hi + lo)/2;       
        Temp = mid % MAX_FILES_SUM;
        f_lseek(fp,512+sizeof(u32)*(Temp-1));              
        if(f_read(fp,(u8 *)&ID,sizeof(u32),&Brw) != FR_OK)
        {
            return 0; //读文件失败
        }                                                       
        if(MeidaID < ID)
            hi=mid;
        else if(MeidaID > ID)
            lo=mid+1;
        else        
            return mid % MAX_FILES_SUM;         
    }
    return 0;
}
/*******************************************************
//功能:用JPEG ID获得文件名
//输入参数：JPEG ID
//输出参数: 绝对路径文件名
//返回:1:成功  0:失败,或者没有该JPEG ID
*******************************************************/
u8 SearchJPEGWithID(u32 MediaID, u8 FileName[25]) 
{
    u8 err=0; 
    FIL file;
    u32 Brw;
    u8 Buffer[15];
    u32 StartIndex;    //第一个文件的索引号    
    u32 EndIndex;      //最后一个文件的索引号    
    u32 FileSD;        //文件序列号
  
    do
    {    
        if(f_open(&file,ff_NameConver("1:/JPEG/INDEX.TXT"),FA_OPEN_ALWAYS|FA_READ|FA_WRITE) == FR_OK)  
        {                                              
            if(f_read(&file,Buffer,8,&Brw) == FR_OK)
            {
                StartIndex = *(u32 *)&Buffer[0]; 
                EndIndex =  *(u32 *)&Buffer[4];
            }
            else
            {
                err = 1;
                break;
            }                                                  
        }
        else
        {
            err = 1;
            break;
        } 
        if(StartIndex > EndIndex)
        { //物理地址转成虚拟地址
            EndIndex += MAX_FILES_SUM;            
        }
        //二分法查找索引
        FileSD = SearchFileSD( &file,StartIndex,EndIndex,MediaID);
    }
    while(0);
    f_close(&file);
    if(err || FileSD==0)
        return 0;
    else
    {
        IntToAsc(FileSD,Buffer); //将整形数转成字符串
        strcpy((char *)FileName,"1:/JPEG/");
        strcat((char *)FileName,(char const *)Buffer);   
        strcat((char *)FileName,".JPG");                     
        return 1; 
    }
}
/*******************************************************
//功能:用WAV ID获得文件名
//输入参数：WAV ID
//输出参数: 绝对路径文件名
//返回:1:成功  0:失败,或者没有该WAV ID
*******************************************************/
u8 SearchWAVWithID(u32 MediaID, u8 FileName[25]) 
{
    u8 err=0; 
    FIL file;
    u32 Brw;
    u8 Buffer[15];
    u32 StartIndex;    //第一个文件的索引号    
    u32 EndIndex;      //最后一个文件的索引号    
    u32 FileSD;        //文件序列号
  
    do
    {    
        if(f_open(&file,ff_NameConver("1:/WAV/INDEX.TXT"),FA_OPEN_ALWAYS|FA_READ|FA_WRITE) == FR_OK)  
        {                                              
            if(f_read(&file,Buffer,8,&Brw) == FR_OK)
            {
                StartIndex = *(u32 *)&Buffer[0]; 
                EndIndex =  *(u32 *)&Buffer[4];
            }
            else
            {
                err = 1;
                break;
            }                                             
        }
        else
        {
            err = 1;
            break;
        } 
        if(StartIndex > EndIndex)
        { //物理地址转成虚拟地址
            EndIndex += MAX_FILES_SUM;   
        }
        //二分法查找索引
        FileSD = SearchFileSD( &file,StartIndex,EndIndex,MediaID);
    }
    while(0);
    f_close(&file);
    if(err || FileSD==0)
        return 0;
    else
    {
        IntToAsc(FileSD,Buffer); //将整形数转成字符串
        strcpy((char *)FileName,"1:/WAV/");
        strcat((char *)FileName,(char const *)Buffer);   
        strcat((char *)FileName,".WAV");                     
        return 1; 
    }
}

